; domain
(define (domain how_to_make_papyrus)
   (:requirements :strips :typing)
   (:types
      papyrus papyrus_tree papyrus_stalks papyrus_strips pruner scissors knife water bowl roller linen_cloth wooden_boards shell ivory smooth_stone bowl_of_water - item
      player direction location
   )

   (:predicates
      (at ?obj - object ?loc - location) ; an object is at a location 
      (inventory ?player ?item) ; an item is in the player's inventory
      (connected ?loc1 - location ?dir - direction ?loc2 - location) ; location 1 is connected to location 2 in the direction
      (strips_between_boards) ; papyrus strips are between two wooden boards
      (strips_woven) ; papyrus strips are woven together
      (polished ?papyrus) ; papyrus is polished
      (flattened ?papyrus) ; papyrus is flat
      (cut ?papyrus) ; papyrus is cut correctly
      (between_boards ?item)
   )

   (:action go ; navigate to an adjacent location 
      :parameters (?dir - direction ?p - player ?l1 - location ?l2 - location) 
      :precondition (and (at ?p ?l1) (connected ?l1 ?dir ?l2))
      :effect (and (at ?p ?l2) (not (at ?p ?l1)))
   )

   (:action get ; pick up an item and put it in the inventory
      :parameters (?item - item ?p - player ?l1 - location) 
      :precondition (and (at ?p ?l1) (at ?item ?l1))
      :effect (and (inventory ?p ?item) (not (at ?item ?l1)))
   )

   (:action pour_water ; pour water into bowl
      :parameters (?p - player) 
      :precondition (and (inventory ?p water) (inventory ?p bowl))
      :effect (and (inventory ?p bowl_of_water) (not (inventory ?p water)) (not (inventory ?p bowl)))
   )

   (:action place_strips_between_boards ; place papyrus strips between two wooden boards
   :parameters (?p - player ?item - object)
   :precondition (and (inventory ?p wooden_boards) (inventory ?p papyrus_strips) (strips_woven))
   :effect (and (between_boards ?item))
)


   (:action cut_stalks ; cut stalks
      :parameters (?p - player ?tree - papyrus_tree ?l1 - location ?s - papyrus_stalks) 
      :precondition (and  (at ?p ?l1) (at ?tree ?l1) (inventory ?p scissors))
      :effect (and (inventory ?p ?s))
   )

    (:action papyrus_strips ; cut strips from stalks
      :parameters (?p - player ?tree - papyrus_tree ?l1 - location ?pst - papyrus_stalks ?strip - papyrus_strips) 
      :precondition (and  (at ?p ?l1) (at ?tree ?l1) (inventory ?p scissors) (inventory ?p ?pst))
      :effect (and (inventory ?p ?strip) (not (inventory ?p ?pst)))
   )

     (:action polish_papyrus ; Use a stone to polish the papyrus.
      :parameters (?p - player ?pap - papyrus) 
      :precondition (and (inventory ?p ?pap) (inventory ?p smooth_stone))
      :effect  (polished ?pap)
   )

    (:action flatten_papyrus ; Use a roller to make the papyrus flat.
      :parameters (?p - player ?pap - papyrus ?r - roller) 
      :precondition (and (inventory ?p ?pap) (inventory ?p ?r))
      :effect  (flattened ?pap)
   )

    (:action cut_paprus ; Use a scissor to cut the papryus.
      :parameters (?p - player ?pap - papyrus ?s - scissors) 
      :precondition (and (inventory ?p ?pap) (inventory ?p ?s))
      :effect  (cut ?pap)
   )





)

; problem
(define (problem finishing_papyrus)
   (:domain how_to_make_papyrus)

   (:objects
   npc - player
   kitchen refrigerator cabinet living_room - location
   east west north south - direction
   papyrus_tree - papyrus_tree
   bowl - bowl
   water - water
   bowl_of_water - bowl_of_water
   scissors - scissors
   papyrus_stalks - papyrus_stalks
   papyrus_strips - papyrus_strips
   smooth_stone - smooth_stone
   papyrus - papyrus
   roller - roller
)

   (:init
      (connected kitchen east refrigerator)
      (connected refrigerator west kitchen)
      (connected kitchen north cabinet)
      (connected cabinet south kitchen)
      (connected living_room north kitchen)
      (connected kitchen south living_room)
      (at npc kitchen)
      (at papyrus kitchen)
      (at water refrigerator)
      (at bowl cabinet)
      (at roller cabinet)
      (at papyrus_tree kitchen)
      (at scissors kitchen)
      (at smooth_stone living_room)
   )

   (:goal (and (cut papyrus) (polished papyrus) (flattened papyrus)))
)

; plan
1. (go north npc kitchen cabinet)
   deleted: (at npc kitchen)
   added: (at npc cabinet)
   goals met: 0 of 3
2. (get roller npc cabinet)
   deleted: (at roller cabinet)
   added: (inventory npc roller)
   goals met: 0 of 3
3. (go south npc cabinet kitchen)
   deleted: (at npc cabinet)
   added: (at npc kitchen)
   goals met: 0 of 3
4. (get scissors npc kitchen)
   deleted: (at scissors kitchen)
   added: (inventory npc scissors)
   goals met: 0 of 3
5. (get papyrus npc kitchen)
   deleted: (at papyrus kitchen)
   added: (inventory npc papyrus)
   goals met: 0 of 3
6. (go south npc kitchen living_room)
   deleted: (at npc kitchen)
   added: (at npc living_room)
   goals met: 0 of 3
7. (get smooth_stone npc living_room)
   deleted: (at smooth_stone living_room)
   added: (inventory npc smooth_stone)
   goals met: 0 of 3
8. (polish_papyrus npc papyrus)
   added: (polished papyrus)
   goals met: 1 of 3
9. (cut_paprus npc papyrus scissors)
   added: (cut papyrus)
   goals met: 2 of 3
10. (flatten_papyrus npc papyrus roller)
   added: (flattened papyrus)
   goals met: 3 of 3
